src/cf/src/Documents/ТабельУчётаРабочегоВремени/ТабельУчётаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчётаРабочегоВремени</name>
  <registerRecords>InformationRegister.ОтработанноеВремяСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТабель</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>_1</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_1_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_2</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_2_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_3</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_3_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_4</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_4_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_5</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_5_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_6</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_6_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_7</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_7_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_8</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_8_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_9</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_9_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_10</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_10_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_11</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_11_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_12</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_12_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_13</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_13_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_14</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_14_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_15</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_15_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_16</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_16_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_17</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_17_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_18</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_18_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_19</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_19_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_20</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_20_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_21</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_21_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_22</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_22_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_23</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_23_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_24</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_24_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_25</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_25_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_26</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_26_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_27</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_27_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_28</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_28_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_29</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_29_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_30</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_30_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_31</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_31_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафику</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>Отработано</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафикуДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ТабельУчётаРабочегоВремени/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Для Каждого Стр Из ТЧТабель Цикл
		РабочийДеньЧасов = Стр.ГрафикРаботы.РабочийДеньЧасов;
		ТекДата = НачалоМесяца(ЭтотОбъект.Дата);
		КонецПериода = КонецМесяца(ЭтотОбъект.Дата);
		Пока ТекДата < КонецПериода Цикл
			НомерДня = День(ТекДата);
			ОтработаноЧасов = Стр["_" + НомерДня];			
			Вариант = Стр["_" + НомерДня + "_Вариант"];
			Если ОтработаноЧасов <> 0 Или Вариант = Справочники.ВариантыВыходаНаРаботу.Рабочий Тогда 			
				НС = Движения.ОтработанноеВремяСотрудников.Добавить();
				НС.ДатаВыхода = ТекДата;
				НС.Сотрудник = Стр.Сотрудник;
				НС.План = РабочийДеньЧасов;
				НС.Факт = ОтработаноЧасов;
				НС.Вариант = Вариант;
			КонецЕсли;
			ТекДата = РаботаСДокументамиКлиентСервер.ДобавитьДень(ТекДата, 1);
		КонецЦикла;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры
